#include<stdio.h>
#include<math.h>
#define name "dataType"
#define test 1
#define PI 3.141592

void sub() {
}


int main() {
	//1. 키워드
	//	키워드는 고유한 의미를 다닌 예약된 단어로 예약어라고 부르기도 한다.
	//	c는 32개의 기본 키워드를 가진다.
	//2. 식별자
	//	사용자가 필요에 따라서 만든 단어가 식별자이다. 
	//	종류는 변수명, 함수명이 있다.
	int a = 1;
	sub();
	//	위 코드에서 식별자는 sub(함수명), a(변수명)이다.
	//	식별자는 식별자 작성 규칙을 준수해야 한다. (이거는 쓸 필요가 없을 듯)

	//1. 상수
	//	상수는 프로그램이 실행되어 끝날 때까지 변하지 않는 자료이다.
	//	상수변수만이 상수가 아니다.
	//	상수는 정수형(1), 실수형(0.1f), 문자('c'), 문자열("C++") 그리고 기호가 있다.
	//	기호상수는 위의 name = "dataType"같은 친구이다.
	//	기호상수를 정의하는 define은 함수가 아닌 전처리문이다.
	//2. 변수
	//	변수는 특정한 값을 저장해 둘 수 있는 장소이다.
	//	변수의 값은 언제나 바뀔 수 있다. (상수변수 같은 놈 제외)
	//	변수는 선언에 앞서 무조건 자료형을 써야 한다. 
	//	그 이유는 변수가 스텍에 저장이 되고, 컴파일러는 스텍의 크기를 프로그램이 시작하기 전에 지정하기 때문
	//	int 도 키워드이다. 
	//	변수에 처음 값을 넣는 것을 초기화라고 한다. 초기화되지 않은 변수는 무의미한 값을 가진다.
	//	그 이유는 컴파일러가 변수가 선언될 때에, 자동으로 더미를 넣기 때문이다,
	
	//1. 정수
	//	정수는 int, long, short가 있다.(char는 솔직히 문자 쓸때 쓰는 친구니까...)
	//	기본형은 signed int
	//	int의 경우 32비트에서는 4바이트, 64비트에서는 8바이트이다.(놀랍다.)
	//	정수 변수에 허용 범위를 넘는 값을 적으면 오버플로가 발생하고, 그 반대에는 언더플로가 발생한다.
	//	math.pow(a,b)는 지수승을 나타낼 때 쓰는 함수이며 a = 밑, b = 지수이다.
	printf("%d", (int)pow(2,4));
	//2. 실수
	//	기본형은 double
	//	실수 출력시 %f, %lf을 변환기호로 쓴다.
	//	%.2f = 2번째까지만 소수점
	//	%6f = 6칸에만 숫자 들어가고 오른쪽 정렬
	//	%+f	= 부호 표시
	//	%-6f = 왼쪽 정렬, 6칸에만 숫자 들어감.
	//3. 문자형
	//	문자 1개 - ''사이에 문자 넣어서 씀. char를 쓰며 1바이트다.
	//	아스키코드나 EBCDIC와 같은 컴퓨터 내부의 문자 코드로 바꿔서 쓴다.

	//11월 19일
	printf("%6d", 1234);
	printf("%+-6d", 123);
	printf("%4f\n\n", 0.00123f);
	//신기하게도, 4를 초과한 값을 넣어서인지, 일부만 나타나지 않고, 모두가 다 나온다.
	//즉 실수형을 쓸 꺼면 4.4f 이런 식으로 해야 하는 듯하다.
	//double
	printf("%lf\n", 0.12345);
	printf("%lf\n", 8 * pow(4, 0.5));

	unsigned int b = pow(2, sizeof(int));
	printf("%ld\n", b);
	b++;
	//아마도 여기서 오버플로우 발생할 듯
	printf("%ld\n", b);

	//이런 데에 전처리문을 넣어도 동작할까
#define pi = 3.14
	//print("%lf",pi);
	//위처럼 하면 pi에 에러가 난다.
	//float c = pi;
	//위처럼 해도 에러가 나는 것으로 보아, 아마도 메서드 밖에 써야 할 듯하다
	
	printf(name);
	//printf("%d")를 하지 않았더니 dataType1이라는 결과를 내놓았다.
	//역시 이건 정상작동한다. 전처리문은 무조건 코드 시작 전에 작성되어야 하는 듯하다
	printf("%d\n", test);
	float radius;
	float area;

	radius = 10.0f;
	area = radius * radius * PI;

	printf("%f\n", area);


	//내일 TODO: 텍스트 박스 만들고, 그 안에 글 적어보기

}

